##  Python Pandas Tutorials- Part 2
In Part we are going to learn about

* StringIO
* Pandas read_csv

In [2]:
### Reading Different Data sources with the help of pandas
from io import StringIO

In [3]:
import pandas as pd

In [4]:
data = ('C1,C2,C3\n'
       'X,Y,1\n'
       'a,b,2\n'
       'c,d,3\n')

In [5]:
type(data)

str

In [7]:
## in memory file format object
StringIO(data)

In [8]:
pd.read_csv(StringIO(data))

  C1 C2  C3
0  X  Y   1
1  a  b   2
2  c  d   3

In [12]:
df = pd.read_csv(StringIO(data),usecols=['C1','C2'])
df

  C1 C2
0  X  Y
1  a  b
2  c  d

In [14]:
df.to_csv('test.csv',index=False)

In [15]:
## datatypes in csv
data = ('a,b,c,d\n'
            '1,2,3,4\n'
            '5,6,7,8\n'
            '9,10,11')

In [17]:
df = pd.read_csv(StringIO(data))

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       2 non-null      float64
dtypes: float64(1), int64(3)
memory usage: 224.0 bytes

In [20]:
df = pd.read_csv(StringIO(data),dtype='object')

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      object
 1   b       3 non-null      object
 2   c       3 non-null      object
 3   d       2 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

In [22]:
df.head()

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [23]:
df.isnull().sum()

a    0
b    0
c    0
d    1
dtype: int64

In [25]:
df['a'][0]

'1'

In [26]:
df = pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':int})

In [27]:
df

   a     b   c    d
0  1   2.0   3  4.0
1  5   6.0   7  8.0
2  9  10.0  11  NaN

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int32
 1   b       3 non-null      float64
 2   c       3 non-null      int32
 3   d       2 non-null      float64
dtypes: float64(2), int32(2)
memory usage: 200.0 bytes

In [29]:
data = ('index,a,b,c\n'
           '4,apple,bat,5.7\n'
            '8,orange,cow,10')

In [35]:
pd.read_csv(StringIO(data),index_col='index')

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [39]:
# use index cols and usecols
data = ('a,b,c\n'
           '4,apple,bat\n'
            '8,orange,cow')

In [41]:
pd.read_csv(StringIO(data),usecols=['a','b','c'],index_col=0)

        b    c
a
4   apple  bat
8  orange  cow

In [48]:
file_path = r"C:\Users\shiva\Downloads\cu.item"
df = pd.read_csv(file_path, sep='\t')
df

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,400
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,375
4,SA0L1,All items less food,1,T,359
...,...,...,...,...,...
395,SSEA011,College textbooks,3,T,314
396,SSEE041,Smartphones,4,T,335
397,SSFV031A,Food at elementary and secondary schools,3,T,122
398,SSGE013,Infants' equipment,3,T,356
399,SSHJ031,Infants' furniture,3,T,165